export type CityType = {
    id: number | string,
    name: string,
    latitude: number,
    longitude: number,
    temperature: string,
    description: string,
    loading: boolean,
    icon: string
    error: string | null
}

export type Message = {
    status: 'info' | 'error' | 'success';
    text: string
}

export const map: Record<number, { desc: string; icon: string }> = {
    0: { desc: "Ясно", icon: "☀" },
    1: { desc: "Преимущественно ясно", icon: "🌤"},
    2: { desc: "Переменная облачность", icon: "🌥️" },
    3: { desc: "Пасмурно", icon: "☁️" },
    45: { desc: "Туман", icon: "🌫" },
    48: { desc: "Туман", icon: "🌫" },
    51: { desc: "Морось: слабая", icon: "🌦️" },
    53: { desc: "Морось: умеренная", icon: "🌦️" },
    55: { desc: "Морось: сильная", icon: "🌦️" },
    56: { desc: "Ледяная морось: слабая", icon: "🌨️" },
    57: { desc: "Ледяная морось: сильная", icon: "🌨️" },
    61: { desc: "Дождь: слабый", icon: "🌧️" },
    63: { desc: "Дождь: умеренный", icon: "🌧️" },
    65: { desc: "Дождь: сильный", icon: "🌧️" },
    66: { desc: "Ледяной дождь: слабый", icon: "🌧️" },
    67: { desc: "Ледяной дождь: сильный", icon: "🌧️" },
    71: { desc: "Снег: слабый", icon: "🌨️" },
    73: { desc: "Снег: умеренный", icon: "🌨️" },
    75: { desc: "Снег: сильный", icon: "🌨️" },
    77: { desc: "Снежные зерна", icon: "🌨️" },
    80: { desc: "Ливневый дождь: слабый", icon: "🌧️" },
    81: { desc: "Ливневый дождь: умеренный", icon: "🌧️" },
    82: { desc: "Ливневый дождь: сильный", icon: "🌧️" },
    85: { desc: "Снегопад: слабый", icon: "🌨️" },
    86: { desc: "Снегопад: сильный", icon: "🌨️" },
    95: { desc: "Гроза: слабая", icon: "🌩️" },
    96: { desc: "Гроза со слабым градом", icon: "⛈" },
    99: { desc: "Гроза с сильным градом", icon: "⛈" },
};
